#coding: utf-8
#Задача 1
h = int(input("Введите h = " ))
d = int(input("Введите d = " ))
if h>d:
    print("Максимальное число ", h)
else:
    print("Максимальное число ", d)