#coding: utf-8
#Задача 10
u = int(input("Введите u = "))
s = int(input("Введите s = "))
d = u / s
print("Результат: ", d)