#coding: utf -8
#Задача 14
S = int(input("Площадь государства: "))
N = int(input("Количество жителей: "))
D = N / S
print("Плотность населения:", D)
