#coding utf-8
#Задача #12
a = int(input("Введите радиус круга a = "))
b = int(input("Введите сторону квадрата b = "))
print("Площадь круга больше")
