#coding utf-8
#Задача #14
a = int(input("Введите a = "))
b = int(input("Введите b = "))
print("f больше значение a ")
print("f больше значение b ")