#coding utf-8
#Задача #15
a = int(input("Введите a = "))
b = int(input("Введите b = "))
print("Первое тело")
print("Второе тело")