#coding: utf-8
#Задача 3
x = int(input("Введите значение x: "))
y = x**2 + 1
print('Значение функции при x =', x, 'равно', y)