#coding: utf-8
#Задача 9
a = int(input("Введите a = "))
s = a**2
v = s*6
print(f'Площадь поверхности куба: {s}\nОбъем куба: {v}')